app/controllers/backoffice/categories_controller.rb

INSERT INTO `categories` (`description`, `created_at`, `updated_at`) VALUES ('', '2021-03-22 21:24:33.494988', '2021-03-22 21:24:33.494988')
---
def create
@category = Category.new (params_category)
if @category.save

UPDATE `categories` SET `categories`.`description` = 'Categoria B', `categories`.`updated_at` = '2021-03-23 10:56:27.180366' WHERE `categories`.`id` = 2
---
def update

  if @category.update(params_category)